#include<string.h>
#include<iomanip>
#include<stdio.h>
#include<iostream>
using namespace std;
void main()
{
	setlocale(LC_CTYPE,"Russian");
	char *st1,*st2,a,z;// d длина строки, k счетчик
	int l,k,j,i,d,s,f=0;// f-счетчик пробелов
	cout<<"Введите длину строки ";
	cin>>d;
	st1= new char[d+1];
	st2= new char[d+1];
	cout<<"Введите строку ";
	gets(st1);
	gets(st1);
	for(i=0;*(st1+i)!='\0';i++)
	{
	  if(*(st1+i)==' ')
		  f++;
	}
	cout<<"Всего "<<f+1<<" слов"<<endl;
	j=0;
	l=0;


		 /*///////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\*\
		| ////////////////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ |	
	    | |||||||||||||НАПИСАТЬ ЦИКЛ, ЧТОБЫ ПРОВЕРЯЛ ВСЕ СЛОВА В СТРОКЕ И ВЫСТАВЛЯЛ ПО АЛФАВИТУ|||||||||||||||||||| |
		| \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\///////////////////////////////////////////////////////// |
	     \*\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\////////////////////////////////////////////////////////*/

		for(i=j;i<d;i++)
			{
				if(*(st1+i)==' ')//первый пробел
					{
						k=i;
						for(i=k+1;i<d;i++)
							if((*(st1+i)==' ')||(*(st1+i)=='\0'))
							{
								if(*(st1+i)==' ')
								s=i;//второй пробел
								if(*(st1+i)=='\0')
									s=i-1;
							break;
							}
						break;
					}
			}
		a=*(st1+k+1);//первая буква второго слова
		z=*(st1+j);//первая буква первого слова

		if(z<a) //если первое слово по алфавиту
		{
			for(l, i=j ; l<k, i<k ;l++, i++)
			{
				*(st2+l)=*(st1+i);
				cout<<*(st2+l);
			}

		}
		if(z>a) //если второе слово по алфавиту
		{
			for(l, i=k+1 ; l<k, i<=s ;l++, i++)
			{
				*(st2+l)=*(st1+i);
				cout<<*(st2+l);
			}
		}
		cout<<endl;
}